newwms_gift/src/Documents/КорректировкаСерийИХарактеристикТоваров/КорректировкаСерийИХарактеристикТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаСерийИХарактеристикТоваров</name>
  <basedOn>Document.итWMSПриемка</basedOn>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатурыНовая</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатурыСтарая</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатурыНовая</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатурыСтарая</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СправкаА</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
    <attributes>
      <name>СправкаБ</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/InformationRegisters/алкСоответствияСправокАиБЕГАИСИСерий/алкСоответствияСправокАиБЕГАИСИСерий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алкСоответствияСправокАиБЕГАИСИСерий</name>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СправкаА</name>
    <type>
      <types>CatalogRef.алкКлассификаторСправокАиБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СправкаБ</name>
    <type>
      <types>CatalogRef.алкКлассификаторСправокАиБ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/Documents/итWMSПриемка/итWMSПриемка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSПриемка</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриемкаИзТранзита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.итФилиалыWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД_ДокументаТранизата</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПроверены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличныхЧастейПриПроверке</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>РасхожденияПМУ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьАктРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацииПримкиWMS</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПолучатель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>КарантинПаллеты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольнаяМарка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнтервалМарки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СправкаБ</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтараяСерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СправкаА</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеФизическогоНосителя</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характиристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПомарочногоУчета</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ДанныеМарокЕГАИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответсвиеДаннныхТТНиСкласдкогоУчета</name>
    <attributes>
      <name>СправкаБ</name>
      <type>
        <types>CatalogRef.алкКлассификаторСправокАиБ</types>
      </type>
    </attributes>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <type>
        <types>CatalogRef.алкКлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/КорректировкаСерийИХарактеристикТоваров/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.итWMSПриемка") Тогда  
		ЗаполнитьНаОснованиПриемки(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
		КонецЕсли;
	КонецПроцедуры
	
Процедура ЗаполнитьНаОснованиПриемки(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)  
	СтандартнаяОбработка=Ложь;  
	
	Запрос = Новый Запрос;
	Запрос.Текст =ТекстЗапросаНаОснованииПриемки();
	Запрос.УстановитьПараметр("Ссылка",ДанныеЗаполнения);
			
	РезультатЗапроса = Запрос.Выполнить();
	Склад=ДанныеЗаполнения.Склад;
	Организация=ДанныеЗаполнения.Организация;    
	Основание=ДанныеЗаполнения;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Товары.Очистить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НоваяСтрока=Товары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);		
	КонецЦикла;


КонецПроцедуры



Функция ТекстЗапросаНаОснованииПриемки()
	Текст="ВЫБРАТЬ
	      |	итWMSПриемкаТовары.СерияНоменклатуры КАК СерияНоменклатурыНовая,
	      |	итWMSПриемкаТовары.СтараяСерияНоменклатуры КАК СерияНоменклатурыСтарая,
	      |	СУММА(итWMSПриемкаТовары.КоличествоФакт) КАК Количество,
	      |	итWMSПриемкаТовары.Номенклатура КАК Номенклатура,
	      |	итWMSПриемкаТовары.Характеристика КАК Характеристика,
	      |	итWMSПриемкаТовары.Номенклатура.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	      |	итWMSПриемкаТовары.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	      |	итWMSПриемкаТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
	      |	ВЫБОР
	      |		КОГДА итWMSПриемкаТовары.Качество = ЗНАЧЕНИЕ(Справочник.Качество.ПустаяСсылка)
	      |			ТОГДА ЗНАЧЕНИЕ(Справочник.Качество.Новый)
	      |		ИНАЧЕ итWMSПриемкаТовары.Качество
	      |	КОНЕЦ КАК Качество,
	      |	итWMSПриемкаТовары.СправкаБ КАК СправкаБ,
	      |	итWMSПриемкаТовары.СправкаА КАК СправкаА
	      |ИЗ
	      |	Документ.итWMSПриемка.Товары КАК итWMSПриемкаТовары
	      |ГДЕ
	      |	итWMSПриемкаТовары.Ссылка = &Ссылка
	      |	И итWMSПриемкаТовары.СерияНоменклатуры <> итWMSПриемкаТовары.СтараяСерияНоменклатуры
	      |	И итWMSПриемкаТовары.СтараяСерияНоменклатуры <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	      |
	      |СГРУППИРОВАТЬ ПО
	      |	итWMSПриемкаТовары.СерияНоменклатуры,
	      |	итWMSПриемкаТовары.СтараяСерияНоменклатуры,
	      |	итWMSПриемкаТовары.Номенклатура,
	      |	итWMSПриемкаТовары.Характеристика,
	      |	итWMSПриемкаТовары.Номенклатура.ЕдиницаИзмеренияМест,
	      |	итWMSПриемкаТовары.Номенклатура.ЕдиницаХраненияОстатков,
	      |	итWMSПриемкаТовары.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	      |	ВЫБОР
	      |		КОГДА итWMSПриемкаТовары.Качество = ЗНАЧЕНИЕ(Справочник.Качество.ПустаяСсылка)
	      |			ТОГДА ЗНАЧЕНИЕ(Справочник.Качество.Новый)
	      |		ИНАЧЕ итWMSПриемкаТовары.Качество
	      |	КОНЕЦ,
	      |	итWMSПриемкаТовары.СправкаБ,
	      |	итWMSПриемкаТовары.СправкаА"; 
	
	Возврат Текст;

КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	Основание=Неопределено;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Для Каждого стр из Товары Цикл 
		Если не стр.СправкаА.Пустая() и не стр.СправкаБ.Пустая() Тогда     
			СтарыйНаборЗаписей=РегистрыСведений.алкСоответствияСправокАиБЕГАИСИСерий.СоздатьНаборЗаписей();
			СтарыйНаборЗаписей.Отбор.СправкаА.Установить(стр.СправкаА);
			СтарыйНаборЗаписей.Отбор.СправкаБ.Установить(стр.СправкаБ);
            СтарыйНаборЗаписей.Отбор.СерияНоменклатуры.Установить(стр.СерияНоменклатурыСтарая);
            СтарыйНаборЗаписей.Прочитать();
			СтарыйНаборЗаписей.Очистить();
			СтарыйНаборЗаписей.Записать();
			
			НовыйНаборЗаписей=РегистрыСведений.алкСоответствияСправокАиБЕГАИСИСерий.СоздатьНаборЗаписей();
			НовыйНаборЗаписей.Отбор.СправкаА.Установить(стр.СправкаА);
			НовыйНаборЗаписей.Отбор.СправкаБ.Установить(стр.СправкаБ); 
		    НовыйНаборЗаписей.Отбор.СерияНоменклатуры.Установить(стр.СерияНоменклатурыНовая);   
			НовыйНаборЗаписей.Прочитать();
			НовыйНаборЗаписей.Очистить();
			НовыйНаборЗаписей.Записать();
			НоваяСтрока=НовыйНаборЗаписей.Добавить();
			НоваяСтрока.СерияНоменклатуры=стр.СерияНоменклатурыНовая;
	        НоваяСтрока.СправкаА=стр.СправкаА;
			НоваяСтрока.СправкаБ=стр.СправкаБ;
            НовыйНаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры
